package cs16.cs06.view;

public class InputView {
    /*
    - 프로그램이 동작하는 동안 계속 입력을 받는다.
    - 1. 움직이려는 말이 있는 위치와 2. 이동하려는 위치를 차례대로 입력 받아서 말을 이동한다.
        - 현재 위치(2자리 문자) -> 이동하려는 위치(2자리 문자)
            - B2->B3 (B2에 있던 Pawn을 B3로 이동한다.)
        - 형식에 맞지 않으면 다시 입력을 받는다.
    - 흑 or 백 말이 상대를 잡으면 게임 끝.
        - 현재 체스판 점수를 출력한다.
    - 입력 값이 '?'로 시작하면, 해당 위치에 있는 말이 움직일 수 있는 경우를 모두 출력한다.
        같은 색의 말이 진행 방향을 막고 있는 경우, 그 직전까지만 표시.
    - 이동 명령은 white -> black 순서. 번갈아서 입력한다.
        - 입력 할 때마다 체스판과 체스말 현황을 출력한다.
     */
}
